Repository: bluan2506/cassava_app
Catalog: lib/l10n/app_*.arb
Languages: th, vi

# tab1
source: Welcome
th: ยินดีต้อนรับ
vi: Xin chào

# tab2
source: Settings
th: การตั้งค่า
vi: Cài đặt

# tab3
source: Advice
th: คำแนะนำ
vi: Lời khuyên

source: Simulation Results
th: ผลการจำลอง
vi: Kết quả mô phỏng

# welcomeMessage
source: Welcome to the Cassava Irrigation App
th: ยินดีต้อนรับสู่แอพพลิเคชั่นการให้น้ำของมันสำปะหลัง
vi: Chào mừng đến với ứng dụng tưới tiêu cho cây sắn

# instructionMessage
source: Please swipe left to get started.
th: โปรดเลื่อนไปทางซ้ายมือเพื่อเริ่มต้น คุณสามารถป้อนข้อมูลได้ที่แท็บตรงกลาง ผลการจำลองจะแสดงที่แท็บด้านขวามือ
vi: Vui lòng lướt sang trái để bắt đầu.

# disclaimerMessage
source: Disclaimer: This app cannot be trusted in any way. Do not use it. The makers do not take any responsibility for anything.
th: การปฏิเสธความรับผิด: แอพพลิเคชั่นนี้ยังไม่สามารถนำไปใช้งานได้จริง ผู้ผลิตจะไม่รับผิดต่อความเสียหายใด ๆ ทั้งสิ้น
vi: Cảnh báo: Ứng dụng là sự tham khảo tương đối, không nên quá tin tưởng vào nó.

source: {fieldName} dismissed
th: {fieldName} แปลงปลูกที่ถูกลบทิ้ง
vi: {fieldName} đã loại bỏ

source: Edit {fieldName}
th: แก้ไข {fieldName}
vi: Chỉnh sửa {fieldName}

source: delete
th: ลบ
vi: Xóa

source: Edit
th: แก้ไข
vi: Chỉnh sửa

# labelTextAddField
source: Field name
th: ชื่อสนาม
vi: Tên cánh đồng

# hintFieldName
source: Enter field name
th: กรอกชื่อสนาม
vi: Nhập tên cánh đồng

# predictTheYieldOfField
source: Predict the yield of {fieldName}
th: พยากรณ์ผลผลิตของ {fieldName}
vi: Dự đoán sản lượng của {fieldName}

source: Monitoring irrigation
th: การตรวจสอบการให้น้ำ
vi: Theo dõi tưới tiêu

source: Download weather data file
th: ดาวน์โหลดไฟล์ข้อมูลสภาพอากาศ
vi: Tải xuống tệp dữ liệu thời tiết

# yield
source: Yield (kg/ha)
th: ผลผลิต (กก./ไร่)
vi: Sản lượng (kg/ha)

# irrigation
source: Irrigation (m^2/ha)
th: การให้น้ำ (ตร.ม./ไร่)
vi: Lượng tưới (m^2/ha)

source: Leaf area index
th: ดัชนีพื้นที่ใบ
vi: Chỉ số diện tích lá

source: Labile carbon (%)
th: แร่ธาตุคาร์บอน (%)

# topsoilWetness
source: Topsoil Wetness (%field capacity)
th: ความชื้นดินเหนียวบนสุด (%ความจุของดิน)
vi: Độ ẩm của lớp đất bề mặt(%field capacity)

# photosynthesis
source: Photosynthesis (g carbon)
th: การสังเคราะห์แสง (กรัมคาร์บอน)
vi: Quang hợp (g carbon)

# topsoilNContent
source: Topsoil N content (mg/kg)
th: ปริมาณไนโตรเจนในดินเหนียวบนสุด (มิลลิกรัม/กิโลกรัม)

# nStatus
source: N status (ratio to optimal)
th: สถานะไนโตรเจน (อัตราส่วนกับสภาวะที่เหมาะสม)

source: Acreage
th: ขนาดพื้นที่ (ไร่)

# enterAcreage
source: Enter the acreage
th: กรอกขนาดพื้นที่
vi: Nhập diện tích

# holesNumber
source: The number of drip holes
th: จำนวนรูปั๊มน้ำหยด
vi: Tổng số lỗ tưới

source: holes
th: รู
vi: lỗ

# enterDripHoles
source: Enter the number of drip holes
th: กรอกจำนวนรูปั๊มน้ำหยด
vi: Nhập số lỗ tưới

source: Auto irrigation
th: ระบบน้ำอัตโนมัติ
vi: Tưới tự động

# goToDetailIrrigation
source: Go to the detail irrigation page
th: ไปยังหน้าตรวจสอบการให้น้ำ

source: Field capacity to maintain (%)
th: ความจุของดินที่ต้องรักษา (%)
vi: Phần trăm độ ẩm tối đa cần duy trì (%)

source: Duration of irrigation
th: ระยะเวลาในการให้น้ำ
vi: Thời gian tưới

# dripRate
source: Drip rate of single hole (l/h/hole)
th: อัตราการไหลของน้ำในรูปั๊มเดียว (ลิตร/ชม./รู)
vi: Tốc độ nhỏ giọt của mỗi lỗ tưới (l/h/hole)

# distanceBetweenHoles
source: Distance between holes (cm)
th: ระยะห่างระหว่างรู (ซม.)
vi: Khoảng cách giữa các lỗ (cm)

# distanceBetweenRows
source: Distance between rows (cm)
th: ระยะห่างระหว่างแถว (ซม.)
vi: Khoảng cách giữa các hàng (cm)

# scaleRain
source: Reduce or increase expected rainfall (%)
th: ปรับเปลี่ยนปริมาณฝน
vi: Giảm hoặc tăng lượng mưa dự kiến (%)

# scaleFertilizer
source: Reduce or increase fertilizer level (%)
th: ลดหรือเพิ่มระดับปุ๋ย (%)
vi: Giảm hoặc tăng mức phân bón (%)

source: Change
th: เปลี่ยน
vi: Thay đổi

source: Manual Irrigation
th: ระบบน้ำด้วยมือ

# amountOfIrrigationToday
source: The amount of irrigation today is
th: ปริมาณการให้น้ำวันนี้
vi: Lượng nước tưới hôm nay là

source: Starting irrigation time
th: เวลาเริ่มให้น้ำ
vi: Thời gian bắt đầu tưới

source: Ending irrigation time
th: เวลาสิ้นสุดการให้น้ำ
vi: Thời gian kết thúc tưới

# amountOfIrrigationFor
source: The amount of irrigation for
th: ปริมาณการให้น้ำสำหรับ
vi: Lượng nước tưới cho

source: Starting time
th: เวลาเริ่มต้น
vi: Thời gian bắt đầu

# chooseIrrigationTime
source: Choose starting irrigation time
th: เลือกเวลาเริ่มให้น้ำ
vi: Chọn thời gian bắt đầu tưới

source: Amount of Irrigation
th: ปริมาณการให้น้ำ
vi: Lượng nước tưới

# enterAmountOfIrrigation
source: Enter the amount of irrigation
th: กรอกปริมาณการให้น้ำ
vi: Nhập lượng tưới

source: Confirm
th: ยืนยัน
vi: Xác nhận

source: Radiation
th: รังสีแสง
vi: Bức xạ

source: Rain fall
th: ปริมาณน้ำฝน
vi: Lượng mưa

source: RelativeHumidity
th: ความชื้นสัมพัทธ์
vi: Độ ẩm tương đối

source: Temperature
th: อุณหภูมิ
vi: Nhiệt độ

source: Wind speed
th: ความเร็วลม
vi: Tốc độ gió

# soil30Humidity
source: 30 cm soil humidity
vi: Độ ẩm đất ở độ sâu 30cm

# soil60Humidity
source: 60 cm soil humidity
vi: Độ ẩm đất ở độ sâu 60cm

source: Irrigation history
vi: Lịch sử tưới tiêu
